################################################################################
## 数据对比
## vnpy.data VS CiticPublic
################################################################################

rm(list = ls())

setwd('/home/fl/myData')
suppressMessages({
  source('./R/Rconfig/myInit.R')
})

## =============================================================================
## fetchData
## 获取数据
## -----------------------------------------------------------------------------
fetchData <- function(db, tbl, start, end) {
    mysql <- mysqlFetch(db)
    query <- paste("
    SELECT TradingDay, Sector,
           InstrumentID as id,
           OpenPrice as open,
           HighPrice as high,
           LowPrice as low,
           ClosePrice as close,
           Volume as volume,
           Turnover as turnover,
           SettlementPrice as stl",
    "FROM", tbl,
    "WHERE TradingDay BETWEEN", start,
    "AND", end)

    if (tbl == 'minute') {
        query <- gsub("Sector", 'Minute', query)
    }

    tempRes <- dbGetQuery(mysql, query) %>% as.data.table() %>%
                .[order(TradingDay)]
    return(tempRes)
}

## =============================================================================

## =============================================================================
## vnpy.data
## -----------------------------------------------------------------------------
dtDailyVnpy <- fetchData(db = 'vnpy', tbl = 'daily',
                         start = 20170818,
                         end   = 20170823)
## =============================================================================


## =============================================================================
## CiticPublic
## -----------------------------------------------------------------------------
dtDailyCitic <- fetchData(db = 'china_futures_bar', tbl = 'daily',
                         start = 20170818,
                         end   = 20170823)

## =============================================================================

x <- dtDailyVnpy[, unique(id)]
y <- dtDailyCitic[, unique(id)]

x[! x %in% y]
y[! y %in% x]


dt <- merge(dtDailyVnpy, dtDailyCitic,
    by = c('TradingDay', 'Sector', 'id'), all = T)

## =============================================================================
dt[, ":="(
    errOpen = (open.x - open.y)/open.y,
    errHigh = (high.x - high.y)/high.y,
    errLow  = (low.x - low.y)/low.y,
    errClose = (close.x - close.y)/close.y,
    errVolume = (volume.x - volume.y)/volume.y,
    errTurnover = (turnover.x - turnover.y)/turnover.y)]

sigValue = 0.001

print("## ------------------------------------------------------------------")
print('## errOpen')
dt[abs(errOpen) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errHigh')
dt[abs(errHigh) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errLow')
dt[abs(errLow) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errClose')
dt[abs(errClose) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errVolume')
dt[abs(errVolume) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errTurnover')
dt[abs(errTurnover) > sigValue]
print("## ------------------------------------------------------------------")
## =============================================================================



## =============================================================================
## vnpy.data
## -----------------------------------------------------------------------------
dtMinuteVnpy <- fetchData(db = 'vnpy', tbl = 'minute',
                         start = 20170818,
                         end   = 20170822)
## =============================================================================


## =============================================================================
## CiticPublic
## -----------------------------------------------------------------------------
dtMinuteCitic <- fetchData(db = 'china_futures_bar', tbl = 'minute',
                         start = 20170818,
                         end   = 20170822)
## =============================================================================
dt <- merge(dtMinuteVnpy, dtMinuteCitic,
    by = c('TradingDay', 'Minute', 'id'), all = T)

## =============================================================================
dt[, ":="(
    errOpen = (open.x - open.y)/open.y,
    errHigh = (high.x - high.y)/high.y,
    errLow  = (low.x - low.y)/low.y,
    errClose = (close.x - close.y)/close.y,
    errVolume = (volume.x - volume.y)/volume.y,
    errTurnover = (turnover.x - turnover.y)/turnover.y)]

sigValue = 0.001

print("## ------------------------------------------------------------------")
print('## errOpen')
dt[abs(errOpen) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errHigh')
dt[abs(errHigh) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errLow')
dt[abs(errLow) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errClose')
dt[abs(errClose) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errVolume')
dt[abs(errVolume) > sigValue]
print("## ------------------------------------------------------------------")

print("## ------------------------------------------------------------------")
print('## errTurnover')
dt[abs(errTurnover) > sigValue]
print("## ------------------------------------------------------------------")
## =============================================================================
