################################################################################
##! ChinaFuturesTickData2mysql_10_read_data.R
## 这是次函数:
## 用于读取 ChinaFuturesTickData 的 csv 文件
##
## 包括:
##
##
##
## 注意:
##
## Author: fl@hicloud-investment.com
## CreateDate: 2017-01-16
## UpdateDate: 2017-01-16
################################################################################
## STEP 2:
################################################################################
if(futures_calendar[k,nchar(nights) == 0]){
  ##-- 如果没有夜盘的话，则需要去掉 myDay
  myDay <- myDay[trading_period %between% c("08:00:00", "16:00:00")]
  myDayPlus <- myDayPlus[trading_period %between% c("08:00:00", "16:00:00")]
}
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
## 夜盘的情况
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#-------------------------------------------------------------------------------
# 正常情况下，是第二天的凌晨 02:30 结束 ------------------------------------##
data_file_1 <- list.files() %>%
  .[grep(paste0("^", args_input[2], ".", futures_calendar[k,as.integer(nights)]+1), .)]

temp <- strsplit(data_file_1,"\\.") %>% unlist() %>% .[c(2,5)] %>% substr(., 9, 10)

if(any(temp[!is.na(temp)] <= "06")){##---------- 夜盘的数据在凌晨获取 --------------------##
  data_file_1 <- data_file_1[which(temp <= "06")]
}else{
  data_file_1 <- NA
}
#-------------------------------------------------------------------------------
# 异常情况下，是当天的 21:00 后可能结束 --------------------------------------##
data_file_2 <- list.files() %>%
  .[grep(paste0("^", args_input[2], ".", futures_calendar[k,nights]), .)]

temp <- strsplit(data_file_2,"\\.") %>% unlist() %>% .[c(2,5)] %>% substr(., 9, 10)

if(any(temp[!is.na(temp)] >= "21")){##---------- 夜盘的数据在当天夜里中断，获取部分数据 --##
  data_file_2 <- data_file_2[which(temp >= "21")]
}else{
  data_file_2 <- NA
}

#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
## 日盘的情况
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#-------------------------------------------------------------------------------
# 日盘数据只有当天取得 -------------------------------------------------------##
data_file_3 <- list.files() %>%
  .[grep(paste0("^", args_input[2], ".", futures_calendar[k, days]), .)]

temp <- strsplit(data_file_3,"\\.") %>% unlist() %>% .[c(2,5)] %>% substr(., 9, 10)

if(any(as.numeric(temp[!is.na(temp)]) %between% c(9,18) )){##----日盘的数据在当天获得 ----##
  data_file_3 <- data_file_3[which(as.numeric(temp) %between% c(9,18))]
}else{
  data_file_3 <- NA
}

#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
## 判断各种情况
#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#-------------------------------------------------------------------------------
# 如果是正常的夜盘，接收数据正常
if(is.na(data_file_1)){         #-- 如果 data_file_1 是空的 ------------------##
  if(is.na(data_file_2)){       #-- 如果 data_file_2 是空的 ------------------##
    dt_night <- data.table()
  }else{                        #-- 如果 data_file_2 是非空的 ----------------##
    dt_night <- myFread(data_file_2)
  }
}else{                          #-- 如果 data_file_1 是非空的 ----------------##
  if(is.na(data_file_2)){
    dt_night <- myFread(data_file_1)
  }else{                       #-- 如果 data_file_1 和 data_file_2 都是非空的
    dt_night <- rbind(
      myFread(data_file_1), myFread(data_file_2)
    )
    #      stop("#---------- One night, two csv files!!!")
  }
}

#-------------------------------------------------------------------------------
# 如果是正常的日盘，接收数据正常 ---------------------------------------------##
if(all(is.na(data_file_3))){
  dt_day <- data.table()      #-- 如果 data_file_3 是空的 --------------------##
}else{                        #-- 如果 data_file_2 是非空的 ------------------##
  if(length(data_file_3) == 1){
    dt_day <- myFread(data_file_3)
  }else{
    dt_day <- rbind(
      myFread(data_file_3[1]),myFread(data_file_3[2])
    )
  }
}
#
#
################################################################################
dt <- list(dt_night, dt_day) %>% rbindlist()

info <- data.table(status = paste("(1) [读入数据]: 原始数据                                :==> Rows:", nrow(dt),
                                  "/ Columns:", ncol(dt), sep=" ")
                   )
################################################################################
