################################################################################
##! fromMySQL.R
## 
## 从　MySQL 数据库提取数据
## 并保存为 fst 格式
##
##
## 注意:
##
## Author: fl@hicloud-investment.com
## CreateDate: 2017-07-20
################################################################################

################################################################################
## STEP 0: 初始化，载入包，设定初始条件
################################################################################
rm(list = ls())
logMainScript <- c("vnpyData2mysql_00_main.R")

setwd('/home/fl/myData/')
suppressMessages({
  source('./R/Rconfig/myInit.R')
})

## =============================================================================
if(! 'fst' %in% installed.packages()) install.packages('fst')
library(fst)
## =============================================================================

## =============================================================================
dataPath <- "./data/FromMySQL"
allDataBases <- c('china_futures_HFT', 'china_futures_bar', 'china_futures_info',
                  'dev', 'jydb', 'HiCloud', 'vnpy', 'YY_SimNow')
for (i in allDataBases) {
    if (! dir.exists(paste(dataPath, i, sep = '/'))) {
        dir.create(paste(dataPath, i, sep = '/'))
    }
}
## =============================================================================


## =============================================================================
## 开始写入数据
## 格式为 fst
## 读取命令: read.fst(file, as.data.table = TRUE)
## =============================================================================
for (i in allDataBases) {
    ## -------------------------------------------------------------------------
    mysql <- mysqlFetch(i)
    allTables <- dbListTables(mysql)
    ## -------------------------------------------------------------------------

    ## -------------------------------------------------------------------------
    for (k in 1:length(allTables)) {
        dt <- dbGetQuery(mysql, paste("
                        SELECT * FROM", allTables[k]))
        ## ---------------------------------------------------------------------
        if (nrow(dt) == 0) {
            dt[1, colnames(dt)] <- NA
        } else {
            write.fst(dt, path = paste0(dataPath, '/', i, '/', allTables[k], '.fst'))
        }
        ## ---------------------------------------------------------------------
    }
    ## -------------------------------------------------------------------------
}
